[
  {
    "role": "Backend Developer",
    "organisation": "Technova Integrasi Solusi",
    "startDate": "Sep, 2025",
    "endDate": "Dec, 2025",
    "experiences": ["Designed and developed clean, efficient RESTful APIs and data processing services, improving system stability by 30% and reducing feature integration time by 25%.", " Collaborated with cross-functional teams to gather requirements and deliver backend solutions that enhanced application performance by 20%.", "Implemented export and import features for Excel and PDF, including dynamic PDF templates with accurate data mapping and structured Excel processing, reducing manual reporting effort by 40% and lowering data inconsistencies by 35%."],
    "imageSrc": "history/technovaid.png"
  },
  {
    "role": "Frontend Developer",
    "organisation": "Sagara Technology",
    "startDate": "Aug, 2024",
    "endDate": "Feb, 2025",
    "experiences": ["Developed a landing page using WordPress, focusing on frontend design and responsiveness.", "Collaborated on a room booking website using React, ensuring a smooth user interface.", "Coordinated with a cross-functional team to deliver high-quality frontend solutions."],
    "imageSrc": "history/sagara.png"
  },
  {
    "role": "Information Technology Developer Intern",
    "organisation": "Telkomsel",
    "startDate": "Jun, 2024",
    "endDate": "Sep, 2024",
    "experiences": ["Developed and maintained web applications using Laravel.", "Created API documentation with Swagger.", "Implemented end-to-end tests using Cypress."],
    "imageSrc": "history/telkomsel.png"
  },
  {
    "role": "Computer Network Management Practicum Assistant",
    "organisation": "SISJAR Labs",
    "startDate": "Feb, 2024",
    "endDate": "Jun, 2024",
    "experiences": [
          "Ensured full resource availability for Computer Network Practicum.",
          "Guided practitioners to perfect scores in Cisco Packet Tracer.",
          "Enhanced student confidence with innovative teaching methods.",
          "Boosted engagement and completion rates through team collaboration."
        ],
    "imageSrc": "history/sisjar.png"
  }
]
